@dahlke FYI - TF treats a CA change as an Update vs Create 

see here for the output of terraform apply on a namespace configured with a ca where the underlying ca was updated and nothing changed in the .tf file 

```

  # temporalcloud_namespace.namespace will be updated in-place
  ~ resource "temporalcloud_namespace" "namespace" {
      ~ accepted_client_ca = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJ5VENDQVZDZ0F3SUJBZ0lSQVNnNUp1TWhvS2xyeEhmL2JNWXQxcXd3Q2dZSUtvWkl6ajBFQXdNd0V6RVIKTUE4R0ExVUVDaE1JZEdWdGNHOXlZV3d3SGhjTk1qUXdOekV3TVRnek56QTBXaGNOTWpVd056RXdNVGd6T0RBMApXakFUTVJFd0R3WURWUVFLRXdoMFpXMXdiM0poYkRCMk1CQUdCeXFHU000OUFnRUdCU3VCQkFBaUEySUFCSDBaCmR0Zy9obkI1ZXNSSVg4K1VVOEJwM25vV2RMY2RhcjltNzJldnNtYXhXMzF5bXgxSGdiQnR5WHdncEtXakg4MDgKNTUvMmVBUHRtY2F2TFFTN0E1YUcwTE81TmJxWFJZNlN4c2N6RTQ1UmxEWjB6YzFDa0pIVXgrRWtQN2JaMTZObwpNR1l3RGdZRFZSMFBBUUgvQkFRREFnR0dNQThHQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGR3d4ClpqKyt4TnFselJ4WlhIZWFLcVlLMTBacE1DUUdBMVVkRVFRZE1CdUNHV05zYVdWdWRDNXliMjkwTG5SbGJYQnYKY21Gc0xuRTNWQzB3Q2dZSUtvWkl6ajBFQXdNRFp3QXdaQUl3YTREVmh5Ui9ZaUdub1pFcTVaYmRBemtQM01mUwozMmFhTGFnK1lZQnZMV0o3a1lubllET1ZxWUtsMjN6bElJOVNBakJkSmw2ZldEalM4bUhSbFo3WFdqUnl5QU51CjBKWTg0VEtQQVFyZUx3eGRtSkkwZlVBWnZlemNnYWN3enJ0bjcvMD0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJ5akNDQVZDZ0F3SUJBZ0lSQVNWK2NGT3ppcWpqa1BqMHlJU00wa013Q2dZSUtvWkl6ajBFQXdNd0V6RVIKTUE4R0ExVUVDaE1JZEdWdGNHOXlZV3d3SGhjTk1qUXhNVEV6TVRZeU1EVTVXaGNOTWpVeE1URXpNVFl5TVRVNQpXakFUTVJFd0R3WURWUVFLRXdoMFpXMXdiM0poYkRCMk1CQUdCeXFHU000OUFnRUdCU3VCQkFBaUEySUFCQXA1ClNEOHZMcjFjQ05oTGRFYW56emlmM2N2RUZubHRnbDdYL0tQWEgrVzFlMmkvQ293N3Zsbk0zZ0F5SVNGeDlRQUgKcFVFQVdmTVVjbjlRdDZpWnhvaytPQXdmNEFKZjFCUGZNN293RndOQmdwVE5SM3NhVzc2QVZ0ODJCaS9VamFObwpNR1l3RGdZRFZSMFBBUUgvQkFRREFnR0dNQThHQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGR1dlCjZSbC9pcGdzQmVuVXZONkJGVXRFd2FaSE1DUUdBMVVkRVFRZE1CdUNHV05zYVdWdWRDNXliMjkwTG5SbGJYQnYKY21Gc0xtdFhabll3Q2dZSUtvWkl6ajBFQXdNRGFBQXdaUUl3REpYR0xQSkZaVWRjR3dVVzhFWE84elo1bWZKTgpPbUZLREFoZHQ0c3NRWGovRFFCQ1ZQOFJwaEZqSGduNS9zWWVBakVBM25GREl2T1FOUUtBenlqQ0M2QngxelFIClJOWUR3Znh3YjFTYW1IVWpZbk1VUlFJQTAzWnEzVHlDZUVnRllIcloKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
      ~ api_key_auth       = false -> (known after apply)
      ~ endpoints          = {
          + grpc_address      = (known after apply)
          ~ mtls_grpc_address = "terraformaws2.ksfop.tmprl.cloud:7233" -> (known after apply)
          ~ web_address       = "https://terraformaws2.ksfop.web.tmprl.cloud" -> (known after apply)
        } -> (known after apply)
        id                 = "terraformaws2.ksfop"
        name               = "terraformaws2"
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

temporalcloud_namespace.namespace: Modifying... [id=terraformaws2.ksfop]
temporalcloud_namespace.namespace: Still modifying... [id=terraformaws2.ksfop, 10s elapsed]
temporalcloud_namespace.namespace: Still modifying... [id=terraformaws2.ksfop, 20s elapsed]
temporalcloud_namespace.namespace: Modifications complete after 24s [id=terraformaws2.ksfop]

```